app/controllers/products_controller.rb

  def index
    products = Product.order("created_at ASC")
---
SELECT `products`.* FROM `products` ORDER BY created_at DESC

  def show
    product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 24 LIMIT 1

  def create
    product = Product.create(product_param)
---
INSERT INTO `products` (`name`, `description`, `sku`, `supplier_name`, `color`, `size`, `unit`, `created_at`, `updated_at`) VALUES ('Prodduct 22', 'qwer', 'w', 'qwert', 'red', 'S', 1, '2023-05-09 11:47:06.191501', '2023-05-09 11:47:06.191501')

  def update
    product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 7 LIMIT 1

  def destroy
    product = Product.find(params[:id])
    product.destroy
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 136 LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 136